In [2]:
import pandas as pd

In [32]:
london = pd.read_csv("data/london_transactions.csv.gz", compression="gzip", sep=r"\t", names=['datetime','drink','price'], index_col=0)
budapest = pd.read_csv("data/budapest.csv.gz", compression="gzip",names=['datetime','drink','price'], index_col=0, header=0)
ny = pd.read_csv("data/ny.csv.gz", compression="gzip",names=['datetime','drink','price'], index_col=0, header=0)

C:\Users\alast\AppData\Local\Temp\ipykernel_7680\3018081244.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  london = pd.read_csv("data/london_transactions.csv.gz", compression="gzip", sep=r"\t", names=['datetime','drink','price'], index_col=0)

In [12]:
london.head(5)

              datetime     drink  price
0  2020-12-30 13:17:00    Mojito    5.5
1  2020-12-27 11:06:15   Sidecar   11.0
2  2020-12-25 17:40:36  Snowball   11.0
3  2020-12-28 08:55:02   Limeade    3.5
4  2020-12-30 20:10:03   Limeade    3.5

In [18]:
london.shape

(50000, 3)

In [31]:
budapest.head(5)

              datetime             drink  price
0  2020-12-30 15:15:53     Sweet Sangria    4.0
1  2020-12-31 18:02:26       Grim Reaper    4.0
2  2020-12-30 00:01:27  Kool-Aid Slammer    3.0
3  2020-12-26 21:58:30         Margarita    7.5
4  2020-12-27 20:51:36         Margarita    7.5

In [23]:
budapest.shape

(50000, 3)

In [33]:
ny.head(5)

           datetime                   drink  price
0  12-26-2020 22:47                Paradise   4.20
1  12-26-2020 08:34             Dry Martini   8.00
2  12-31-2020 18:41  Kill the cold Smoothie  11.00
3  12-29-2020 15:38              Cuba Libra   2.99
4  12-26-2020 07:09            Campari Beer   7.50

In [27]:
ny.shape

(50000, 3)

Need to take care around column names, separators and indexes as well as the format of the date time columns

Need a dimension table for the glass types, bar id and drinks combo bar as price may be different for a drink across the bars